# 1 판다스 입문

In [ ]:
import pandas as pd

In [ ]:
population1 = {'서울':9700000,'부산':4500000,'인천':4000000,'광주':2000000,'대구':2500000}
popu = pd.Series(population1)
print(popu)

#series: 인덱스와 짝지어진 데이터로 이루어진 1차원 배열

서울    9700000
부산    4500000
인천    4000000
광주    2000000
대구    2500000
dtype: int64

In [ ]:
popu.value_counts()

#각 범주별 데이터 값의 개수 count
#빈도가 높은 데이터 값부터 출력
#역순 정렬 가능(reversed=True)

2500000    1
4500000    1
2000000    1
4000000    1
9700000    1
dtype: int64

In [ ]:
popu.unique()

#시리즈 내 unique한 값 출력

array([9700000, 4500000, 4000000, 2000000, 2500000])

In [ ]:
popu.nunique()

#시리즈 내 unique한 값의 개수 출력

5

In [ ]:
#문제 : df2 데이터에서 각 class별 생존율을 구하시오.

import seaborn as sns
df2 = sns.load_dataset('titanic')
df2.groupby('class')['survived'].agg(lambda x: x.sum()/len(x))

#Method chaining
#method의 반환 값을 통해 또 다른 함수 호출
#간략하게 표현 가능, 길어지면 가독성 감소

class
First     0.629630
Second    0.472826
Third     0.242363
Name: survived, dtype: float64

In [ ]:
pd.DataFrame(popu,columns=['pop'])

#시리즈를 데이터프레임으로 변환할 때 열 이름 부여해 변환
#1차원 -> 2차원의 행렬 자료 + 열벡터의 열 이름 부여

        pop
서울  9700000
부산  4500000
인천  4000000
광주  2000000
대구  2500000

In [ ]:
import seaborn as sns
iris = sns.load_dataset('iris')
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [ ]:
iris.index

#열의 개수가 많을 때 확인하기 유용

RangeIndex(start=0, stop=150, step=1)

In [ ]:
iris.columns

#열의 개수가 많을 때 확인하기 유용

Index(['sepal_length', 'sepal_width', 'petal_length', 'petal_width',
       'species'],
      dtype='object')

In [ ]:
iris.values

#열의 개수가 많을 때 확인하기 유용

array([[5.1, 3.5, 1.4, 0.2, 'setosa'],
       [4.9, 3.0, 1.4, 0.2, 'setosa'],
       [4.7, 3.2, 1.3, 0.2, 'setosa'],
       [4.6, 3.1, 1.5, 0.2, 'setosa'],
       [5.0, 3.6, 1.4, 0.2, 'setosa'],
       [5.4, 3.9, 1.7, 0.4, 'setosa'],
       [4.6, 3.4, 1.4, 0.3, 'setosa'],
       [5.0, 3.4, 1.5, 0.2, 'setosa'],
       [4.4, 2.9, 1.4, 0.2, 'setosa'],
       [4.9, 3.1, 1.5, 0.1, 'setosa'],
       [5.4, 3.7, 1.5, 0.2, 'setosa'],
       [4.8, 3.4, 1.6, 0.2, 'setosa'],
       [4.8, 3.0, 1.4, 0.1, 'setosa'],
       [4.3, 3.0, 1.1, 0.1, 'setosa'],
       [5.8, 4.0, 1.2, 0.2, 'setosa'],
       [5.7, 4.4, 1.5, 0.4, 'setosa'],
       [5.4, 3.9, 1.3, 0.4, 'setosa'],
       [5.1, 3.5, 1.4, 0.3, 'setosa'],
       [5.7, 3.8, 1.7, 0.3, 'setosa'],
       [5.1, 3.8, 1.5, 0.3, 'setosa'],
       [5.4, 3.4, 1.7, 0.2, 'setosa'],
       [5.1, 3.7, 1.5, 0.4, 'setosa'],
       [4.6, 3.6, 1.0, 0.2, 'setosa'],
       [5.1, 3.3, 1.7, 0.5, 'setosa'],
       [4.8, 3.4, 1.9, 0.2, 'setosa'],
       [5.0, 3.0, 1.6, 0.2, 'setosa'],
       [5.0, 3.4, 1.6, 0.4, 'setosa'],
       [5.2, 3.5, 1.5, 0.2, 'setosa'],
       [5.2, 3.4, 1.4, 0.2, 'setosa'],
       [4.7, 3.2, 1.6, 0.2, 'setosa'],
       [4.8, 3.1, 1.6, 0.2, 'setosa'],
       [5.4, 3.4, 1.5, 0.4, 'setosa'],
       [5.2, 4.1, 1.5, 0.1, 'setosa'],
       [5.5, 4.2, 1.4, 0.2, 'setosa'],
       [4.9, 3.1, 1.5, 0.2, 'setosa'],
       [5.0, 3.2, 1.2, 0.2, 'setosa'],
       [5.5, 3.5, 1.3, 0.2, 'setosa'],
       [4.9, 3.6, 1.4, 0.1, 'setosa'],
       [4.4, 3.0, 1.3, 0.2, 'setosa'],
       [5.1, 3.4, 1.5, 0.2, 'setosa'],
       [5.0, 3.5, 1.3, 0.3, 'setosa'],
       [4.5, 2.3, 1.3, 0.3, 'setosa'],
       [4.4, 3.2, 1.3, 0.2, 'setosa'],
       [5.0, 3.5, 1.6, 0.6, 'setosa'],
       [5.1, 3.8, 1.9, 0.4, 'setosa'],
       [4.8, 3.0, 1.4, 0.3, 'setosa'],
       [5.1, 3.8, 1.6, 0.2, 'setosa'],
       [4.6, 3.2, 1.4, 0.2, 'setosa'],
       [5.3, 3.7, 1.5, 0.2, 'setosa'],
       [5.0, 3.3, 1.4, 0.2, 'setosa'],
       [7.0, 3.2, 4.7, 1.4, 'versicolor'],
       [6.4, 3.2, 4.5, 1.5, 'versicolor'],
       [6.9, 3.1, 4.9, 1.5, 'versicolor'],
       [5.5, 2.3, 4.0, 1.3, 'versicolor'],
       [6.5, 2.8, 4.6, 1.5, 'versicolor'],
       [5.7, 2.8, 4.5, 1.3, 'versicolor'],
       [6.3, 3.3, 4.7, 1.6, 'versicolor'],
       [4.9, 2.4, 3.3, 1.0, 'versicolor'],
       [6.6, 2.9, 4.6, 1.3, 'versicolor'],
       [5.2, 2.7, 3.9, 1.4, 'versicolor'],
       [5.0, 2.0, 3.5, 1.0, 'versicolor'],
       [5.9, 3.0, 4.2, 1.5, 'versicolor'],
       [6.0, 2.2, 4.0, 1.0, 'versicolor'],
       [6.1, 2.9, 4.7, 1.4, 'versicolor'],
       [5.6, 2.9, 3.6, 1.3, 'versicolor'],
       [6.7, 3.1, 4.4, 1.4, 'versicolor'],
       [5.6, 3.0, 4.5, 1.5, 'versicolor'],
       [5.8, 2.7, 4.1, 1.0, 'versicolor'],
       [6.2, 2.2, 4.5, 1.5, 'versicolor'],
       [5.6, 2.5, 3.9, 1.1, 'versicolor'],
       [5.9, 3.2, 4.8, 1.8, 'versicolor'],
       [6.1, 2.8, 4.0, 1.3, 'versicolor'],
       [6.3, 2.5, 4.9, 1.5, 'versicolor'],
       [6.1, 2.8, 4.7, 1.2, 'versicolor'],
       [6.4, 2.9, 4.3, 1.3, 'versicolor'],
       [6.6, 3.0, 4.4, 1.4, 'versicolor'],
       [6.8, 2.8, 4.8, 1.4, 'versicolor'],
       [6.7, 3.0, 5.0, 1.7, 'versicolor'],
       [6.0, 2.9, 4.5, 1.5, 'versicolor'],
       [5.7, 2.6, 3.5, 1.0, 'versicolor'],
       [5.5, 2.4, 3.8, 1.1, 'versicolor'],
       [5.5, 2.4, 3.7, 1.0, 'versicolor'],
       [5.8, 2.7, 3.9, 1.2, 'versicolor'],
       [6.0, 2.7, 5.1, 1.6, 'versicolor'],
       [5.4, 3.0, 4.5, 1.5, 'versicolor'],
       [6.0, 3.4, 4.5, 1.6, 'versicolor'],
       [6.7, 3.1, 4.7, 1.5, 'versicolor'],
       [6.3, 2.3, 4.4, 1.3, 'versicolor'],
       [5.6, 3.0, 4.1, 1.3, 'versicolor'],
       [5.5, 2.5, 4.0, 1.3, 'versicolor'],
       [5.5, 2.6, 4.4, 1.2, 'versicolor'],
       [6.1, 3.0, 4.6, 1.4, 'versicolor'],
       [5.8, 2.6, 4.0, 1.2, 'versicolor'],
       [5.0, 2.3, 3.3, 1.0, 'versicolor'],
       [5.6, 2.7, 4.2, 1.3, 'versicolor'],
       [5.7, 3.0, 4.2, 1.2, 'versicolor'],
       [5.7, 2.9, 4.2, 1.3, 'versicolor'],
       [6.2, 2.9, 4.3, 1.3, 'versicolor'],
       [5.1, 2.5, 3.0, 1.1, 'versicolor'],
       [5.7, 2.8, 4.1, 1.3, 'versicolor'],
       [6.3, 3.3, 6.0, 2.5, 'virginica'],
       [5.8, 2.7, 5.1, 1.9, 'virginica'],
       [7.1, 3.0, 5.9, 2.1, 'virginica'],
       [6.3, 2.9, 5.6, 1.8, 'virginica'],
       [6.5, 3.0, 5.8, 2.2, 'virginica'],
       [7.6, 3.0, 6.6, 2.1, 'virginica'],
       [4.9, 2.5, 4.5, 1.7, 'virginica'],
       [7.3, 2.9, 6.3, 1.8, 'virginica'],
       [6.7, 2.5, 5.8, 1.8, 'virginica'],
       [7.2, 3.6, 6.1, 2.5, 'virginica'],
       [6.5, 3.2, 5.1, 2.0, 'virginica'],
       [6.4, 2.7, 5.3, 1.9, 'virginica'],
       [6.8, 3.0, 5.5, 2.1, 'virginica'],
       [5.7, 2.5, 5.0, 2.0, 'virginica'],
       [5.8, 2.8, 5.1, 2.4, 'virginica'],
       [6.4, 3.2, 5.3, 2.3, 'virginica'],
       [6.5, 3.0, 5.5, 1.8, 'virginica'],
       [7.7, 3.8, 6.7, 2.2, 'virginica'],
       [7.7, 2.6, 6.9, 2.3, 'virginica'],
       [6.0, 2.2, 5.0, 1.5, 'virginica'],
       [6.9, 3.2, 5.7, 2.3, 'virginica'],
       [5.6, 2.8, 4.9, 2.0, 'virginica'],
       [7.7, 2.8, 6.7, 2.0, 'virginica'],
       [6.3, 2.7, 4.9, 1.8, 'virginica'],
       [6.7, 3.3, 5.7, 2.1, 'virginica'],
       [7.2, 3.2, 6.0, 1.8, 'virginica'],
       [6.2, 2.8, 4.8, 1.8, 'virginica'],
       [6.1, 3.0, 4.9, 1.8, 'virginica'],
       [6.4, 2.8, 5.6, 2.1, 'virginica'],
       [7.2, 3.0, 5.8, 1.6, 'virginica'],
       [7.4, 2.8, 6.1, 1.9, 'virginica'],
       [7.9, 3.8, 6.4, 2.0, 'virginica'],
       [6.4, 2.8, 5.6, 2.2, 'virginica'],
       [6.3, 2.8, 5.1, 1.5, 'virginica'],
       [6.1, 2.6, 5.6, 1.4, 'virginica'],
       [7.7, 3.0, 6.1, 2.3, 'virginica'],
       [6.3, 3.4, 5.6, 2.4, 'virginica'],
       [6.4, 3.1, 5.5, 1.8, 'virginica'],
       [6.0, 3.0, 4.8, 1.8, 'virginica'],
       [6.9, 3.1, 5.4, 2.1, 'virginica'],
       [6.7, 3.1, 5.6, 2.4, 'virginica'],
       [6.9, 3.1, 5.1, 2.3, 'virginica'],
       [5.8, 2.7, 5.1, 1.9, 'virginica'],
       [6.8, 3.2, 5.9, 2.3, 'virginica'],
       [6.7, 3.3, 5.7, 2.5, 'virginica'],
       [6.7, 3.0, 5.2, 2.3, 'virginica'],
       [6.3, 2.5, 5.0, 1.9, 'virginica'],
       [6.5, 3.0, 5.2, 2.0, 'virginica'],
       [6.2, 3.4, 5.4, 2.3, 'virginica'],
       [5.9, 3.0, 5.1, 1.8, 'virginica']], dtype=object)

In [ ]:
iris.shape

#데이터프레임 병합 시 확인 필요

(150, 5)

In [ ]:
iris.shape[0]

#indexing으로 행의 개수, 열의 개수만 확인 가능

150

In [ ]:
iris.dtypes

#데이터 타입 살펴보기 + 열별 데이터 타입 확인 가능

sepal_length    float64
sepal_width     float64
petal_length    float64
petal_width     float64
species          object
dtype: object

In [ ]:
len(iris)

#행의 길이 확인

150

In [ ]:
iris.size

#size: 행의 개수 X 열의 개수 = 값의 개수

750

In [ ]:
iris.head()

#상위 데이터

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [ ]:
iris.tail()

#하위 데이터

     sepal_length  sepal_width  petal_length  petal_width    species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [ ]:
iris.describe()

#실수 타입 열 데이터에 대한 통계량
#결측치는 제외하고 계산한 값

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [ ]:
iris.info()

#데이터프레임의 전체적인 구조 확인 + 월별 결측치 개수, 데이터타입 메모리 사용량, 등

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   sepal_length  150 non-null    float64
 1   sepal_width   150 non-null    float64
 2   petal_length  150 non-null    float64
 3   petal_width   150 non-null    float64
 4   species       150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [ ]:
iris.min()

#series로 출력

sepal_length       4.3
sepal_width          2
petal_length         1
petal_width        0.1
species         setosa
dtype: object

In [ ]:
iris.quantile(0.25)

#원하는 quantile 값 지정하기
#오름차순의 25%되는 값

sepal_length    5.1
sepal_width     2.8
petal_length    1.6
petal_width     0.3
Name: 0.25, dtype: float64

# 2 데이터프레임 다루기

In [ ]:
print(iris.loc[0:1,:])

#loc : 0행에서 1행까지의 자료를 slicing -> [a:b]는 a에서 b자리수 까지를 의미

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa

In [ ]:
print(iris.iloc[0:1,:])

#0행 자료를 Slicing ->[a:b]는 a에서 b-1자리수 까지를 의미

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa

In [ ]:
iris.loc[:,'sepal_width']
iris.iloc[:,1]

#여러 개의 행/열을 연속적으로 추출
#iloc가 적합

0      3.5
1      3.0
2      3.2
3      3.1
4      3.6
      ...
145    3.0
146    2.5
147    3.0
148    3.4
149    3.0
Name: sepal_width, Length: 150, dtype: float64

In [ ]:
iris.loc[0:2,['sepal_width','sepal_length']]

#열의 개수/종류가 많을 때 필요한 열만 추출
#loc가 적합

   sepal_width  sepal_length
0          3.5           5.1
1          3.0           4.9
2          3.2           4.7

In [ ]:
iris['sepal_width']>4

#Boolean indexing

0      False
1      False
2      False
3      False
4      False
       ...
145    False
146    False
147    False
148    False
149    False
Name: sepal_width, Length: 150, dtype: bool

In [ ]:
iris[iris['sepal_width']>4]

#3개밖에 없네

    sepal_length  sepal_width  petal_length  petal_width species
15           5.7          4.4           1.5          0.4  setosa
32           5.2          4.1           1.5          0.1  setosa
33           5.5          4.2           1.4          0.2  setosa

In [ ]:
iris[iris['sepal_length'].isin([5.0,5.1])].head()

#특정 값을 지닌 행들을 추출

    sepal_length  sepal_width  petal_length  petal_width species
0            5.1          3.5           1.4          0.2  setosa
4            5.0          3.6           1.4          0.2  setosa
7            5.0          3.4           1.5          0.2  setosa
17           5.1          3.5           1.4          0.3  setosa
19           5.1          3.8           1.5          0.3  setosa

In [ ]:
iris[iris['species']=='setosa'][['sepal_width','sepal_length']].head()

#예시 1

   sepal_width  sepal_length
0          3.5           5.1
1          3.0           4.9
2          3.2           4.7
3          3.1           4.6
4          3.6           5.0

In [ ]:
iris[(iris['sepal_width']>4) & (iris['species']=='setosa')].head()

#예시 2

    sepal_length  sepal_width  petal_length  petal_width species
15           5.7          4.4           1.5          0.4  setosa
32           5.2          4.1           1.5          0.1  setosa
33           5.5          4.2           1.4          0.2  setosa

In [ ]:
iris[iris['sepal_length'].isin([5.0,5.1])].head()

#Query함수, 조건문
#DataFrame.query(‘조건문’)
#Boolean indexing에서 사용했던 연산자 사용가능
#외부 변수명 또는 함수명 사용 시 앞에 @를 붙여 사용

    sepal_length  sepal_width  petal_length  petal_width species
0            5.1          3.5           1.4          0.2  setosa
4            5.0          3.6           1.4          0.2  setosa
7            5.0          3.4           1.5          0.2  setosa
17           5.1          3.5           1.4          0.3  setosa
19           5.1          3.8           1.5          0.3  setosa

In [ ]:
iris.query('sepal_length>5').head(3)

#Query함수 예시 1

    sepal_length  sepal_width  petal_length  petal_width species
0            5.1          3.5           1.4          0.2  setosa
5            5.4          3.9           1.7          0.4  setosa
10           5.4          3.7           1.5          0.2  setosa

In [ ]:
iris.query('species == "setosa" and sepal_length in [5.0,5.1]').head(3)

#Query함수 예시 2

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa
7           5.0          3.4           1.5          0.2  setosa

In [ ]:
length = 5
iris.query('sepal_length == @length').head(3)

#Query함수 예시 3

    sepal_length  sepal_width  petal_length  petal_width species
4            5.0          3.6           1.4          0.2  setosa
7            5.0          3.4           1.5          0.2  setosa
25           5.0          3.0           1.6          0.2  setosa

In [ ]:
str_expr = "sepal_width == 3.5"
iris.query(str_expr).head(3)

#Query함수 예시 4

    sepal_length  sepal_width  petal_length  petal_width species
0            5.1          3.5           1.4          0.2  setosa
17           5.1          3.5           1.4          0.3  setosa
27           5.2          3.5           1.5          0.2  setosa

In [ ]:
iris.sort_values(by='sepal_width')

#기준 열을 기준으로 데이터프레임 정렬
#여러 개의 기준열을 사용할 경우 앞서 있는 열 기준으로 먼저 정렬
#default값 = ascending

     sepal_length  sepal_width  petal_length  petal_width     species
60            5.0          2.0           3.5          1.0  versicolor
62            6.0          2.2           4.0          1.0  versicolor
119           6.0          2.2           5.0          1.5   virginica
68            6.2          2.2           4.5          1.5  versicolor
41            4.5          2.3           1.3          0.3      setosa
..            ...          ...           ...          ...         ...
16            5.4          3.9           1.3          0.4      setosa
14            5.8          4.0           1.2          0.2      setosa
32            5.2          4.1           1.5          0.1      setosa
33            5.5          4.2           1.4          0.2      setosa
15            5.7          4.4           1.5          0.4      setosa

[150 rows x 5 columns]

In [ ]:
#문제 iris의 species 열 값을 setosa는 1, 그 외의 값들은 0으로 변환하시오. (apply, lambda)
iris['species'] = iris['species'].apply(lambda x: 1 if x=='setosa' else 0) 
iris

#값들을 원하는 방식으로 변경
#function, lambda 모두 사용 가능

     sepal_length  sepal_width  petal_length  petal_width  species
0             5.1          3.5           1.4          0.2        1
1             4.9          3.0           1.4          0.2        1
2             4.7          3.2           1.3          0.2        1
3             4.6          3.1           1.5          0.2        1
4             5.0          3.6           1.4          0.2        1
..            ...          ...           ...          ...      ...
145           6.7          3.0           5.2          2.3        0
146           6.3          2.5           5.0          1.9        0
147           6.5          3.0           5.2          2.0        0
148           6.2          3.4           5.4          2.3        0
149           5.9          3.0           5.1          1.8        0

[150 rows x 5 columns]

In [ ]:
import seaborn as sns
iris = sns.load_dataset('iris')
iris.groupby('species')['sepal_width'].sum().reset_index()

#집계 결과를 reset_index()를 통해 새 데이터프레임으로 만들기

      species  sepal_width
0      setosa        171.4
1  versicolor        138.5
2   virginica        148.7

# 3 데이터프레임 합치기

In [ ]:
Q1 = pd.DataFrame([[1,2,3],[4,5,6]],columns=list('abc'))
Q2 = pd.DataFrame([[11,22,33],[44,55,66]],columns=list('bcd'))
print(Q1)
print("----------------------------")
print(Q2)

   a  b  c
0  1  2  3
1  4  5  6
----------------------------
    b   c   d
0  11  22  33
1  44  55  66

In [ ]:
print(pd.concat([Q1,Q2]))

#데이터프레임을 위아래로 연결
print("----------------------------")
print(pd.concat([Q1,Q2],axis=1))

#axis = 1을 사용해 옆으로 붙히기
print("--------------------")
print(pd.concat([Q1,Q2],ignore_index=True))

#행 인덱스는 본래 형태 유지
# ignore_index=True를 사용해 변경
print("--------------------")
print(pd.concat([Q1,Q2],join='inner'))

#join=‘inner' ->행 인덱스 교집합 기준

     a   b   c     d
0  1.0   2   3   NaN
1  4.0   5   6   NaN
0  NaN  11  22  33.0
1  NaN  44  55  66.0
----------------------------
   a  b  c   b   c   d
0  1  2  3  11  22  33
1  4  5  6  44  55  66
--------------------
     a   b   c     d
0  1.0   2   3   NaN
1  4.0   5   6   NaN
2  NaN  11  22  33.0
3  NaN  44  55  66.0
--------------------
    b   c
0   2   3
1   5   6
0  11  22
1  44  55

In [ ]:
S1 = pd.DataFrame([[1,'aa',3],[4,'bb',5]],columns=list('abc'))
S2 = pd.DataFrame([[11,'bb'],[22,'aa']],columns=list('db'))
print(S1)
print("----------------------------")
print(S2)
print("----------------------------")
#공통된 모든 열을 기준으로 디폴트 값

S3 = pd.merge(S1,S2,on='b')
print(S3)
#공통된 열이 있을 때 on=‘열＇을 기준으로 병합

   a   b  c
0  1  aa  3
1  4  bb  5
----------------------------
    d   b
0  11  bb
1  22  aa
----------------------------
   a   b  c   d
0  1  aa  3  22
1  4  bb  5  11

In [ ]:
S1 = pd.DataFrame([[1,'aa',3,22],[4,'bb',5,3]],columns=list('abcd'))
S2 = pd.DataFrame([[11,'bb',3,3],[22,3,'aa',1]],columns=list('dcba'))

S3 = pd.merge(S1, S2, how='inner')
print(S3)
print('---------------------')

S1 = pd.DataFrame([[1,'aa',3,22],[4,'bb',5]],columns=list('abcd'))
S2 = pd.DataFrame([[11,'cc']],columns=list('db'))
S4 = pd.merge(S1,S2, how='outer')
print(S4)
print('---------------------')

S1 = pd.DataFrame([[1,'aa',3,22],[4,'bb',5]],columns=list('abcd'))
S2 = pd.DataFrame([[11,'cc']],columns=list('db'))
S5 = pd.merge(S1,S2,how='left')
print(S5)

   a   b  c   d
0  1  aa  3  22
---------------------
     a   b    c     d
0  1.0  aa  3.0  22.0
1  4.0  bb  5.0   NaN
2  NaN  cc  NaN  11.0
---------------------
   a   b  c     d
0  1  aa  3  22.0
1  4  bb  5   NaN

In [ ]:
df1 = pd.DataFrame({'a':['a0','a1','a2'],'b':['b0','b1','b2'],'c':['c0','c1','c2']},index=[0,1,2])
df2 = pd.DataFrame({'e':['e1','e2','e3'],'f':['f1','f2','f3'],'g':['g1','g2','g3']},index=[1,2,3])
df3 = df1.join(df2)
df3

#행 인덱스를 기준으로 결합함

    a   b   c    e    f    g
0  a0  b0  c0  NaN  NaN  NaN
1  a1  b1  c1   e1   f1   g1
2  a2  b2  c2   e2   f2   g2

# 4 결측치 처리하기

In [ ]:
titanic = sns.load_dataset('titanic')
titanic.head()

#결측치 확인

   survived  pclass     sex   age  ...  deck  embark_town  alive  alone
0         0       3    male  22.0  ...   NaN  Southampton     no  False
1         1       1  female  38.0  ...     C    Cherbourg    yes  False
2         1       3  female  26.0  ...   NaN  Southampton    yes   True
3         1       1  female  35.0  ...     C  Southampton    yes  False
4         0       3    male  35.0  ...   NaN  Southampton     no   True

[5 rows x 15 columns]

In [ ]:
df = titanic[['pclass','age','sibsp','fare','class']]
df

     pclass   age  sibsp     fare   class
0         3  22.0      1   7.2500   Third
1         1  38.0      1  71.2833   First
2         3  26.0      0   7.9250   Third
3         1  35.0      1  53.1000   First
4         3  35.0      0   8.0500   Third
..      ...   ...    ...      ...     ...
886       2  27.0      0  13.0000  Second
887       1  19.0      0  30.0000   First
888       3   NaN      1  23.4500   Third
889       1  26.0      0  30.0000   First
890       3  32.0      0   7.7500   Third

[891 rows x 5 columns]

In [ ]:
df.isnull().sum()

#info()에서도 확인 가능

pclass      0
age       177
sibsp       0
fare        0
class       0
dtype: int64

In [ ]:
df.dropna(how='any').shape

#모든 행에서 Na값이 하나라도 있으면 행 삭제

(714, 5)

In [ ]:
df.dropna(how='all').shape

#모든 행의 값이 Na 이면 행을 삭제

(891, 5)

In [ ]:
df.fillna(df.mean(), inplace=True)
df

/usr/local/lib/python3.7/dist-packages/pandas/core/series.py:4536: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  downcast=downcast,

     pclass        age  sibsp     fare   class
0         3  22.000000      1   7.2500   Third
1         1  38.000000      1  71.2833   First
2         3  26.000000      0   7.9250   Third
3         1  35.000000      1  53.1000   First
4         3  35.000000      0   8.0500   Third
..      ...        ...    ...      ...     ...
886       2  27.000000      0  13.0000  Second
887       1  19.000000      0  30.0000   First
888       3  29.699118      1  23.4500   Third
889       1  26.000000      0  30.0000   First
890       3  32.000000      0   7.7500   Third

[891 rows x 5 columns]

In [ ]:
titanic = sns.load_dataset('titanic')
df = titanic[['pclass','age','sibsp','fare','class']]
df

#888번째 값을 집중적으로 확인

     pclass   age  sibsp     fare   class
0         3  22.0      1   7.2500   Third
1         1  38.0      1  71.2833   First
2         3  26.0      0   7.9250   Third
3         1  35.0      1  53.1000   First
4         3  35.0      0   8.0500   Third
..      ...   ...    ...      ...     ...
886       2  27.0      0  13.0000  Second
887       1  19.0      0  30.0000   First
888       3   NaN      1  23.4500   Third
889       1  26.0      0  30.0000   First
890       3  32.0      0   7.7500   Third

[891 rows x 5 columns]

In [ ]:
df.fillna(method='bfill')


#888번째 값을 집중적으로 확인
#이후 값으로 대체

     pclass   age  sibsp     fare   class
0         3  22.0      1   7.2500   Third
1         1  38.0      1  71.2833   First
2         3  26.0      0   7.9250   Third
3         1  35.0      1  53.1000   First
4         3  35.0      0   8.0500   Third
..      ...   ...    ...      ...     ...
886       2  27.0      0  13.0000  Second
887       1  19.0      0  30.0000   First
888       3  26.0      1  23.4500   Third
889       1  26.0      0  30.0000   First
890       3  32.0      0   7.7500   Third

[891 rows x 5 columns]

In [ ]:
df.fillna(method='ffill')

#888번째 값을 집중적으로 확인
#이전값으로 대체

     pclass   age  sibsp     fare   class
0         3  22.0      1   7.2500   Third
1         1  38.0      1  71.2833   First
2         3  26.0      0   7.9250   Third
3         1  35.0      1  53.1000   First
4         3  35.0      0   8.0500   Third
..      ...   ...    ...      ...     ...
886       2  27.0      0  13.0000  Second
887       1  19.0      0  30.0000   First
888       3  19.0      1  23.4500   Third
889       1  26.0      0  30.0000   First
890       3  32.0      0   7.7500   Third

[891 rows x 5 columns]

In [ ]:
df.fillna({'age':0,'fare':1})

#888번째 값을 집중적으로 확인
#mapping한 값으로 대체

     pclass   age  sibsp     fare   class
0         3  22.0      1   7.2500   Third
1         1  38.0      1  71.2833   First
2         3  26.0      0   7.9250   Third
3         1  35.0      1  53.1000   First
4         3  35.0      0   8.0500   Third
..      ...   ...    ...      ...     ...
886       2  27.0      0  13.0000  Second
887       1  19.0      0  30.0000   First
888       3   0.0      1  23.4500   Third
889       1  26.0      0  30.0000   First
890       3  32.0      0   7.7500   Third

[891 rows x 5 columns]